performanceTestResult/bzt.igCW/effective.yml
---
cli:
  linter:
    disable: false
    ignored-warnings: []
    lint-and-exit: false
    warn-on-unfamiliar-fields: false
cli-aliases:
  cloud:
    provisioning: cloud
  detach:
    modules:
      cloud:
        detach: true
  func:
    modules:
      console:
        disable: true
    settings:
      aggregator: functional-consolidator
  gui:
    modules:
      jmeter:
        gui: true
  install-tools:
    services:
    - install-checker
  lint:
    cli:
      linter:
        lint-and-exit: true
  local:
    provisioning: local
  locations:
    modules:
      cloud:
        dump-locations: true
    provisioning: cloud
  nolint:
    cli:
      linter:
        disable: true
  public:
    modules:
      blazemeter:
        public-report: true
  report:
    reporting:
    - blazemeter
  sequential:
    modules:
      local:
        sequential: true
execution:
- concurrency:
    local: 3
  executor: jmeter
  hold-for: 3m
  ramp-up: 1m
  scenario: nex
  throughput: {}
included-configs: []
modules:
  ab:
    class: bzt.modules.ab.ApacheBenchmarkExecutor
  android-emulator:
    class: bzt.modules.services.AndroidEmulatorLoader
  apiritif:
    class: bzt.modules._apiritif.ApiritifNoseExecutor
  appium:
    class: bzt.modules.services.AppiumLoader
  blazemeter:
    class: bzt.modules.blazemeter.BlazeMeterUploader
  capturehar:
    class: bzt.modules.blazemeter.ServiceStubCaptureHAR
  cloud:
    class: bzt.modules.blazemeter.CloudProvisioning
    default-location: us-central1-a
  console:
    class: bzt.modules.console.ConsoleStatusReporter
    disable: true
  consolidator:
    class: bzt.modules.aggregator.ConsolidatingAggregator
    percentiles:
    - 0.0
    - 50.0
    - 90.0
    - 95.0
    - 99.0
    - 99.9
    - 100.0
  external-results-loader:
    class: bzt.modules.external.ExternalResultsLoader
  final-stats:
    class: bzt.modules.reporting.FinalStatus
  final_stats:
    class: bzt.modules.reporting.FinalStatus
  functional-consolidator:
    class: bzt.modules.functional.FunctionalAggregator
  gatling:
    class: bzt.modules.gatling.GatlingExecutor
    properties:
      gatling.data.file.bufferSize: 256
  install-checker:
    class: bzt.modules.services.InstallChecker
  jmeter:
    class: bzt.modules.jmeter.JMeterExecutor
    path: /home/mudar123/.bzt/jmeter-taurus/5.2.1/bin/jmeter.sh
    plugins:
    - jpgc-casutg
    - jpgc-dummy
    - jpgc-ffw
    - jpgc-fifo
    - jpgc-functions
    - jpgc-json
    - jpgc-perfmon
    - jpgc-prmctl
    - jpgc-tst
    properties:
      jmeter.save.saveservice.autoflush: 'true'
      jmeter.save.saveservice.connect_time: 'true'
      jmeterengine.force.system.exit: 'true'
      summariser.name: ''
    protocol-handlers:
      http: bzt.jmx.http.HTTPProtocolHandler
      mqtt: bzt.jmx.mqtt.MQTTProtocolHandler
    system-properties:
      sun.net.inetaddr.ttl: 0
    version: 5.2.1
  junit:
    class: bzt.modules.java.JUnitTester
  junit-xml:
    class: bzt.modules.reporting.JUnitXMLReporter
  k6:
    class: bzt.modules.k6.K6Executor
  local:
    class: bzt.modules.provisioning.Local
  locust:
    class: bzt.modules._locustio.LocustIOExecutor
  mocha:
    class: bzt.modules.javascript.MochaTester
  molotov:
    class: bzt.modules._molotov.MolotovExecutor
  monitoring:
    class: bzt.modules.monitoring.Monitoring
  newman:
    class: bzt.modules.javascript.NewmanExecutor
  nunit:
    class: bzt.modules.csharp.NUnitExecutor
  passfail:
    class: bzt.modules.passfail.PassFailStatus
  pip-install:
    class: bzt.modules.services.PipInstaller
  proxy2jmx:
    class: bzt.modules.proxy2jmx.Proxy2JMX
  pytest:
    class: bzt.modules._pytest.PyTestExecutor
  robot:
    class: bzt.modules.robot.RobotExecutor
  rspec:
    class: bzt.modules.ruby.RSpecTester
  screenshoter:
    class: bzt.modules.blazemeter.ServiceStubScreenshoter
  selenium:
    class: bzt.modules._selenium.SeleniumExecutor
  shellexec:
    class: bzt.modules.shellexec.ShellExecutor
  siege:
    class: bzt.modules.siege.SiegeExecutor
  testng:
    class: bzt.modules.java.TestNGTester
  tsung:
    class: bzt.modules.tsung.TsungExecutor
  unpacker:
    class: bzt.modules.services.Unpacker
  vegeta:
    class: bzt.modules.vegeta.VegetaExecutor
  virtual-display:
    class: bzt.modules.services.VirtualDisplay
  wdio:
    class: bzt.modules.javascript.WebdriverIOExecutor
  xunit:
    class: bzt.modules.csharp.XUnitExecutor
provisioning: local
reporting:
- module: final-stats
- module: console
- dump-xml: stats.xml
  module: final-stats
- module: blazemeter
scenarios:
  nex:
    data-sources:
    - loop: true
      path: ./test/nex-users.csv
    default-address: http://localhost:8000
    requests:
    - assert:
      - contains:
        - 200
        not: false
        subject: http-code
      body: "{\n  \"id\": \"${id}-${__javaScript(Math.random())}\",\n  \"title\": \"${title}\",\n  \"passenger_capacity\": ${passenger_capacity},\n  \"maximum_speed\": ${maximum_speed},\n  \"in_stock\": ${in_stock}\n}          \n"
      extract-jsonpath:
        default:
          jsonpath: NOT_FOUND
        product_id:
          jsonpath: $.id
      headers:
        Content-Type: application/json
        cache-control: no-cache
      label: products-create
      method: POST
      think-time: uniform(0s, 0s)
      url: /products
    - if: '"${product_id}" == "NOT_FOUND"'
      then:
      - action: continue
    - assert:
      - contains:
        - 200
        not: false
        subject: http-code
      extract-jsonpath:
        default:
          jsonpath: NOT_FOUND
        product_key:
          jsonpath: $.id
      label: product-get
      method: GET
      think-time: uniform(0s, 0s)
      url: /products/${product_id}
    - assert:
      - contains:
        - 200
        not: false
        subject: http-code
      body: |
        {
          "order_details": [{"product_id": "${product_id}", "price": "100000.99", "quantity": 1}]
        }
      extract-jsonpath:
        default:
          jsonpath: NOT_FOUND
        order_id:
          jsonpath: $.id
      headers:
        Content-Type: application/json
        cache-control: no-cache
      label: orders-create
      method: POST
      think-time: uniform(0s, 0s)
      url: /orders
    - if: '"${order_id}" == "NOT_FOUND"'
      then:
      - action: continue
    - assert:
      - contains:
        - 200
        not: false
        subject: http-code
      extract-jsonpath:
        default:
          jsonpath: NOT_FOUND
        order_id:
          jsonpath: $.id
      label: order-get
      method: GET
      think-time: uniform(0s, 0s)
      url: /orders/${order_id}
    - if: '"${order_id}" == "NOT_FOUND"'
      then:
      - action: continue
    variables:
      apigee_client_id: client_id
      apigee_client_secret: '********'
      hello: world
services:
- local:
  - metrics:
    - cpu
    - mem
    - bytes-sent
    - bytes-recv
    - disk-read
    - disk-write
    - disk-space
    - engine-loop
    - conn-all
  module: monitoring
settings:
  aggregator: consolidator
  artifacts-dir: /tmp/bzt.igCW
  default-executor: jmeter
  env:
    OBJC_DISABLE_INITIALIZE_FORK_SAFETY: 'YES'
    TAURUS_ARTIFACTS_DIR: /tmp/bzt.igCW
version: 1.16.0